#include <stdio.h> // ใช้เรียกไลบรารีพื้นฐาน

int main(){ // ฟังก์ชันหลักของโปรเเกรม
    int a = 5, b=17; // ประกาศตัวแปรจำนวนเต็ม a และ b
    float c = 8.5, d = 4.0; // ประกาศตัวแปรจำนวนจริง c และ d
    printf("1. a,b = %d, %d, c,d = %.2f,%.2f\n", a, b, c, d); // แสดงค่าของตัวแปร a, b, c และ d
    printf("2. d+a =%.2f\n", d + a); // แสดงผลลัพธ์ของการบวก d กับ a
    printf("3. a-b = %d\n", a - b); // แสดงผลลัพธ์ของการลบ b จาก a
    printf("4. c*d = %.2f\n", c * d); // แสดงผลลัพธ์ของการคูณ c กับ d
    printf("5. a*c = %.2f\n", a * c); // แสดงผลลัพธ์ของการคูณ a กับ c
    printf("6. c/d = %.2f\n", c / d); // แสดงผลลัพธ์ของการหาร c ด้วย d
    printf("7. b/c = %.2f\n", b / c); // แสดงผลลัพธ์ของการหาร b ด้วย c
    printf("8. a%%b = %d\n", a % b); // แสดงผลลัพธ์ของการหารเอาเศษ a หาร b
    printf("9. c%%a = %d\n", (int)c % a); // แสดงผลลัพธ์ของการหารเอาเศษ c หาร a (แปลง c เป็นจำนวนเต็มก่อน)
    printf("10. c%%d = %d\n", (int)c % (int)d); // แสดงผลลัพธ์ของการหารเอาเศษ c หาร d (แปลง c และ d เป็นจำนวนเต็มก่อน)
    return 0;
}

//การอภิปรายผลจากการทดลองของโค้ดนี้ มีวัตถุประสงค์เพื่อแสดงให้เห็นว่า การใช้ตัวแปรชนิดต่าง ๆ (int, float) 
//และ การดำเนินการทางคณิตศาสตร์ ในภาษา C มีผลอย่างไรต่อผลลัพธ์ที่แสดงออกมาบนหน้าจอ รวมถึงแนวคิดของการ แปลงชนิดข้อมูล  และ รูปแบบการแสดงผล 