#include <stdio.h> //เรียกไลบรารีพื้นฐาน

int main() { //ฟังก์ชันหลักของโปรแกรม
    printf("------------W06-02-1------------\n"); //แสดงหัวข้อของโปรแกรมคือ W06-02-1
    int i=1, j=2, k; //ประกาศตัวแปรจำนวนเต็ม i, j และ k โดย i เริ่มต้นที่ 1 และ j เริ่มต้นที่ 2
    k = i + j; //คำนวณผลรวมของ i กับ j, k = 1 + 2 = 3
    printf("2: i = %d, j = %d, k = %d\n", i, j, k);  //แสดงค่าของ i, j และ k
    i = i + (k * j);//คำนวณ: i = 1 + (3 * 2) = 1 + 6 = 7
    printf("3: i = %d, j = %d, k = %d\n", i, j, k); //แสดงค่าของ i, j และ k
    j = i / 2;//คำนวณ: j = 7 / 2 = 3 (หารจำนวนเต็ม)
    printf("4: i = %d, j = %d, k = %d\n", i, j, k); //แสดงค่าของ i, j และ k
    k = i % 2;  //คำนวณ: k = 7 % 2 = 1 (หารเอาเศษ)
    printf("5: i = %d, j = %d, k = %d\n", i, j, k);  //แสดงค่าของ i, j และ k
    i = (j + k) * 3; //คำนวณ: i = (3 + 1) * 3 = 4 * 3 = 12
    printf("6: i = %d, j = %d, k = %d\n", i, j, k); //แสดงค่าของ i, j และ k
    return 0; //คืนค่า 0 เพื่อบ่งชี้ว่าโปรแกรมทำงานสำเร็จ
}