#include <stdio.h>   

int main(){
    printf("------------W06-02-2------------\n"); // แสดงหัวข้อของโปรแกรมคือ W06-02-2
    double x=1.0 , y=2.0 ,z; // ประกาศตัวแปรจำนวนจริงโดย x เริ่มต้นที่ 10 และ y เริ่มต้นที่ 2.0 เเล้ว z ยังไม่กำหนดค่า
    x = y + 5.0; //คำนวณผลรวมของ y กับ 5.0, x = 2.0 + 5.0 = 7.0
    printf("2: x = %.1f, y = %.1f, z = ?\n", x, y); // แสดงค่าของ x y และ z
    y = x / 2.0; ////คำนวณผลรวมของ x กับ 2.0, y = 7.0 / 2.0 = 3.5
    printf("3: x = %.1f, y = %.1f, z = ?\n", x, y); // แสดงค่าของ x y และ z
    y = (x * 3.0) + 4.0; //คำนวณผลรวมของ x กับ 3.0 และ 4.0, y = (7.0 * 3.0) + 4.0 = 21.0 + 4.0 = 25.0
    printf("4: x = %.1f, y = %.1f, z = ?\n", x, y); // แสดงค่าของ x y และ z
    x = -0.5 - y; //คำนวณผลรวมของ -0.5 กับ y, x = -0.5 - 25.0 = -25.5
    printf("5: x = %.1f, y = %.1f, z = ?\n", x, y); // แสดงค่าของ x y และ z
    z = x + y; //คำนวณผลรวมของ x กับ y, z = -25.5 + 25.0 = -0.5
    printf("6: x = %.1f, y = %.1f, z = %.1f\n", x, y, z); // แสดงค่าของ x y และ z
    return 0; // คืนค่า 0 เพื่อบ่งชี้ว่าโปรแกรมทำงานสำเร็จ
}