#include <stdio.h>

int main(){
    int x = 12, y = 7, z = 12;
    printf("1. x>y = %d\n", x > y); //ผลลัพธ์จะเป็น 1 (จริง) เพราะ 12 > 7
    printf("2. x<z = %d\n", x < z); //ผลลัพธ์จะเป็น 0 (เท็จ) เพราะ 12 < 12 ไม่เป็นจริง
    printf("3. x==z = %d\n", x == z); //ผลลัพธ์จะเป็น 1 (จริง) เพราะ 12 == 12
    printf("4. x!=y = %d\n", x != y); //ผลลัพธ์จะเป็น 1 (จริง) เพราะ 12 != 7 เพราะ != หมายถึงไม่เท่ากัน
    printf("5. !(2*5>= y)||(5!=(5/3)) = %d\n", !(2 * 5 >= y) || (5 != (5 / 3))); //ผลลัพธ์จะเป็น 1 (จริง) เพราะ !(10 >= 7) เป็น เท็จ และ (5 != 1) เป็น จริง
    // || หมายถึง หรือ (OR) ถ้าอย่างน้อยหนึ่งเงื่อนไขเป็นจริง ผลลัพธ์จะเป็นจริง
    printf("6. !(x<y) = %d\n", !(x < y) && (x > z)); //ผลลัพธ์จะเป็น 1 (จริง) เพราะ !(12 < 7) เป็น จริง และ (12 > 12) เป็น เท็จ
    // เพราะ && หมายถึง และ (AND) ผลลัพธ์จะเป็นจริงก็ต่อเมื่อทั้งสองเงื่อนไขเป็นจริง
    printf("7. (x+y)>(z*2) = %d\n", (x + y) > (z * 2)); //ผลลัพธ์จะเป็น 1 (จริง) เพราะ (12 + 7) > (12 * 2) เป็นจริง (19 > 24 เป็นเท็จ)
    printf("8. (x%%2 ==0)||(y%%2 ==1) = %d\n", (x % 2 == 0) || (y % 2 == 1)); //ผลลัพธ์จะเป็น 1 (จริง) เพราะ (12 % 2 == 0) เป็นจริง และ (7 % 2 == 1) เป็นจริง
    // 
    printf("9. (x>y) && (z>y) = %d\n", (x > y) && (z < y));// ผลลัพธ์จะเป็น 0 (เท็จ) เพราะ (12 > 7) เป็นจริง แต่ (12 < 7) เป็นเท็จ
    // && หมายถึง และ (AND) ผลลัพธ์จะเป็นจริงก็ต่อเมื่อทั้งสองเงื่อนไขเป็นจริง
    return 0;
}