#include <stdio.h>

int main(){
    int A; // ประกาศตัวแปร A
    A = -2+5*2;  // คำนวณค่า A โดยใช้การบวกและคูณ
    printf("A = %d\n", A); // แสดงผลลัพธ์ของ A โดย 5 * 2 ก่อน ได้ 10 เเล้ว -2 + 10 ได้ 8
    int B;  // ประกาศตัวแปร B
    B = 10/2*3; // คำนวณค่า B โดยใช้การหารเเละคูณ
    printf("B = %d\n", B); // แสดงผลลัพธ์ของ B โดย 10 / 2 ก่อน ได้ 5 เเล้ว 5 * 3 ได้ 15
    int C; // ประกาศตัวแปร C
    C = 6/2+3*(4%2); // คำนวณค่า C โดยใช้การหาร, การบวก, การคูณ และการหารเอาเศษ
    printf("C = %d\n", C); // แสดงผลลัพธ์ของ C โดย 6 / 2 ก่อน ได้ 3 เเล้ว 4 % 2 ได้ 0 เเล้ว 3 + 3 * 0 ได้ 3
    int D; // ประกาศตัวแปร D
    D = (5+2)*15%4; // คำนวณค่า D โดยใช้วงเล็บ, การบวก, การคูณ และการหารเอาเศษ
    printf("D = %d\n", D); // แสดงผลลัพธ์ของ D โดย 5 + 2 ก่อน ได้ 7 เเล้ว 7 * 15 ได้ 105 เเล้ว 105 % 4 ได้ 1
    int E; // ประกาศตัวแปร E
    E = 6+2*2-6/2; // คำนวณค่า E โดยใช้การบวก, การคูณ และการหาร
    printf("E = %d\n", E); // แสดงผลลัพธ์ของ E โดย 2 * 2 ก่อน ได้ 4 เเล้ว 6 / 2 ได้ 3 เเล้ว 6 + 4 - 3 ได้ 7
    int F; // ประกาศตัวแปร F
    F = 5+3*2-8/4+(6%5);// คำนวณค่า F โดยใช้การบวก, การคูณ, การหาร และการหารเอาเศษ
    printf("F = %d\n", F); // แสดงผลลัพธ์ของ F โดย 3 * 2 ก่อน ได้ 6 เเล้ว 8 / 4 ได้ 2 เเล้ว 6 % 5 ได้ 1 เเล้ว 5 + 6 - 2 + 1 ได้ 10
    int G; // ประกาศตัวแปร G
    G = (4+3)*2-10/(2+3);  // คำนวณค่า G โดยใช้วงเล็บ, การบวก, การคูณ และการหาร
    printf("G = %d\n", G); // แสดงผลลัพธ์ของ G โดย 4 + 3 ก่อน ได้ 7 เเล้ว 10 / (2 + 3) ได้ 2 เเล้ว 7 * 2 - 2 ได้ 12
    return 0;// คืนค่า 0 เพื่อบ่งชี้ว่าโปรแกรมทำงานสำเร็จ
}