#include <stdio.h>

int main(){ // ฟังก์ชันหลักของโปรแกรม
    int a = 5, b = 2; // ประกาศตัวแปรจำนวนเต็ม a และ b
    float x = 3.0, y = 4.5; // ประกาศตัวแปรจำนวนจริง x และ y
    int r1; // ประกาศตัวแปรจำนวนเต็ม r1
    r1 = a++ * b + (int)y % 3;  //a++ = ใช้ค่า a = 5 ก่อน แล้วค่อยเพิ่มเป็น 6 จะเป็น 5 * 2 + (4.5 % 3) = 10 + 1 = 11
    printf("r1 = %d\n", r1);  // แสดงผลลัพธ์ของ r1
    int r2; // ประกาศตัวแปรจำนวนเต็ม r2
    r2 = (a > b) && ((int)x / b < 2); // (a > b) = (6 > 2) เป็นจริง และ ((int)x / b < 2) = (3 / 2 < 2) เป็นจริง ดังนั้น r2 = 1
    printf("r2 = %d\n", r2); // แสดงผลลัพธ์ของ r2
    float r3; // ประกาศตัวแปรจำนวนจริง r3
    r3 = ++x * y - a / 2; // ++x บวกค่าก่อนละจึงใช้เป็น 3.0 + 1.0 = 4.0, y = 4.5, a = 6 ดังนั้น r3 = 4.0 * 4.5 - 6 / 2 = 18 - 3 = 15.0
    printf("r3 = %.2f\n", r3); // แสดงผลลัพธ์ของ r3
    float r4; // ประกาศตัวแปรจำนวนจริง r4
    r4 = ((x += 1.5) > y) || (b-- > 0); // (x += 1.5) = 4.0 + 1.5 = 5.5, ดังนั้น (5.5 > 4.5) เป็นจริง และ (b-- > 0) = (2 > 0) เป็นจริง ดังนั้น r4 = 1
    printf("r4 = %.2f\n", r4); // แสดงผลลัพธ์ของ r4
    return 0; // คืนค่า 0 เพื่อบ่งชี้ว่าโปรแกรมทำงานสำเร็จ
}
// การอภิปรายผลจากการ Coding นี้ มีวัตถุประสงค์เพื่อแสดงให้เห็นถึงการใช้ตัวดำเนินการต่าง ๆ ในภาษา C เช่น การเพิ่มค่า, การเปรียบเทียบ, และการดำเนินการทางคณิตศาสตร์ รวมถึงการใช้ตัวแปรชนิดต่าง ๆ 